Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements class defines the requirements for valid polygon behavior.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements.Closed
Gets or sets a value indicating whether the polygon must be considered as a closed loop.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements.Planar
Gets or sets a value indicating whether the polygon must be planar.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements.MinimumVertexCount
Gets the minimum number of vertices in the polygon.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements.MaximumVertexCount
Gets the maximum number of vertices in the polygon.